using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Diagnostics;
using System.Drawing;
using System.IO;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace zml.liuyao
{
    public partial class Form1 : Form
    {

        private string calcTodayOrYestoday()
        {

            string jintian = null;
            if (DateTime.Now.Hour < 13)
            {
                jintian = "今天";
            }
            else
            {
                jintian = "明天";
            }

            return jintian;
        }


        public Form1()
        {
            InitializeComponent();
            textBox1.Focus();//定位第一次输入下挂所在的位置
            textBox4.Text = calcTodayOrYestoday() + "最高价是多少  从开盘到收盘整体趋势上涨还是下跌";
            label8.Text = DateTime.Now.ToString();
        }

        private void drawQian(Pen p, Graphics g, bool isUP)//乾卦
        {
            int deltaX = 80; int deltaY = 20;
            int x10 = 429; int x11 = x10 + deltaX;
            // int x20 = x10+ deltaY; int x21 = x20 + deltaX;
            // int x30 = x20+ deltaY; int x31 = x30 + deltaX;

            int y1 = 410;

            if (isUP == false)
            {
                y1 = 410 + deltaY * 3;
            }

            int y2 = y1 + deltaY;

            int y3 = y2 + deltaY;

            g.DrawLine(p, x10, y1, x11, y1);
            g.DrawLine(p, x10, y2, x11, y2);
            g.DrawLine(p, x10, y3, x11, y3);

        }

        private void drawKun(Pen p, Graphics g, bool isUP)//kun卦
        {
            int deltaX = 35; int deltaY = 20; int gap = 10;
            int x10 = 429; int x11 = x10 + deltaX;
            int x12 = x11 + gap;
            int x13 = x12 + deltaX;


            int y1;
            if (isUP == false)
            {
                y1 = 410 + deltaY * 3;
            }
            else
            {
                y1 = 410;
            }
            int y2 = y1 + deltaY;
            int y3 = y2 + deltaY;

            g.DrawLine(p, x10, y1, x11, y1);
            g.DrawLine(p, x12, y1, x13, y1);

            g.DrawLine(p, x10, y2, x11, y2);
            g.DrawLine(p, x12, y2, x13, y2);

            g.DrawLine(p, x10, y3, x11, y3);
            g.DrawLine(p, x12, y3, x13, y3);

        }


        private void drawZhen(Pen p, Graphics g, bool isUP)//kun卦
        {
            int deltaX = 35; int deltaY = 20; int gap = 10;
            int x10 = 429; int x11 = x10 + deltaX;
            int x12 = x11 + gap;
            int x13 = x12 + deltaX;


            int y1;
            if (isUP == false)
            {
                y1 = 410 + deltaY * 3;
            }
            else
            {
                y1 = 410;
            }
            int y2 = y1 + deltaY;
            int y3 = y2 + deltaY;

            g.DrawLine(p, x10, y1, x11, y1);
            g.DrawLine(p, x12, y1, x13, y1);

            g.DrawLine(p, x10, y2, x11, y2);
            g.DrawLine(p, x12, y2, x13, y2);

            g.DrawLine(p, x10, y3, x13, y3);

        }


        private void drawXun(Pen p, Graphics g, bool isUP)//乾卦
        {

            int deltaX = 35; int deltaY = 20; int gap = 10;
            int x10 = 429; int x11 = x10 + deltaX;
            int x12 = x11 + gap;
            int x13 = x12 + deltaX;


            int y1;
            if (isUP == false)
            {
                y1 = 410 + deltaY * 3;
            }
            else
            {
                y1 = 410;
            }
            int y2 = y1 + deltaY;
            int y3 = y2 + deltaY;

            g.DrawLine(p, x10, y1, x13, y1);

            g.DrawLine(p, x10, y2, x13, y2);

            g.DrawLine(p, x10, y3, x11, y3);
            g.DrawLine(p, x12, y3, x13, y3);
        }


        private void drawKan(Pen p, Graphics g, bool isUP)//乾卦
        {

            int deltaX = 35; int deltaY = 20; int gap = 10;
            int x10 = 429; int x11 = x10 + deltaX;
            int x12 = x11 + gap;
            int x13 = x12 + deltaX;


            int y1;
            if (isUP == false)
            {
                y1 = 410 + deltaY * 3;
            }
            else
            {
                y1 = 410;
            }
            int y2 = y1 + deltaY;
            int y3 = y2 + deltaY;


            g.DrawLine(p, x10, y1, x11, y1);
            g.DrawLine(p, x12, y1, x13, y1);

            g.DrawLine(p, x10, y2, x13, y2);


            g.DrawLine(p, x10, y3, x11, y3);
            g.DrawLine(p, x12, y3, x13, y3);
        }

        private void drawLi(Pen p, Graphics g, bool isUP)//kun卦
        {
            int deltaX = 35; int deltaY = 20; int gap = 10;
            int x10 = 429; int x11 = x10 + deltaX;
            int x12 = x11 + gap;
            int x13 = x12 + deltaX;


            int y1;
            if (isUP == false)
            {
                y1 = 410 + deltaY * 3;
            }
            else
            {
                y1 = 410;
            }
            int y2 = y1 + deltaY;
            int y3 = y2 + deltaY;

            g.DrawLine(p, x10, y1, x13, y1);
            // g.DrawLine(p, x12, y1, x13, y1);

            g.DrawLine(p, x10, y2, x11, y2);
            g.DrawLine(p, x12, y2, x13, y2);

            g.DrawLine(p, x10, y3, x13, y3);
            //g.DrawLine(p, x12, y3, x13, y3);
        }


        private void drawGen(Pen p, Graphics g, bool isUP)//kun卦
        {
            int deltaX = 35; int deltaY = 20; int gap = 10;
            int x10 = 429; int x11 = x10 + deltaX;
            int x12 = x11 + gap;
            int x13 = x12 + deltaX;


            int y1;
            if (isUP == false)
            {
                y1 = 410 + deltaY * 3;
            }
            else
            {
                y1 = 410;
            }
            int y2 = y1 + deltaY;
            int y3 = y2 + deltaY;

            g.DrawLine(p, x10, y1, x13, y1);
            //  g.DrawLine(p, x12, y1, x13, y1);

            g.DrawLine(p, x10, y2, x11, y2);
            g.DrawLine(p, x12, y2, x13, y2);

            g.DrawLine(p, x10, y3, x11, y3);
            g.DrawLine(p, x12, y3, x13, y3);

        }


        private void drawDui(Pen p, Graphics g, bool isUP)//兑卦
        {
            int deltaX = 35; int deltaY = 20; int gap = 10;
            int x10 = 429; int x11 = x10 + deltaX;
            int x12 = x11 + gap;
            int x13 = x12 + deltaX;


            int y1;
            if (isUP == false)
            {
                y1 = 410 + deltaY * 3;
            }
            else
            {
                y1 = 410;
            }
            int y2 = y1 + deltaY;
            int y3 = y2 + deltaY;

            g.DrawLine(p, x10, y1, x11, y1);
            g.DrawLine(p, x12, y1, x13, y1);

            g.DrawLine(p, x10, y2, x13, y2);

            g.DrawLine(p, x10, y3, x13, y3);

        }

        private void drawDongYao(Pen p, Graphics g, string postion)//动爻
        {
            p.Color = Color.Red;
            int deltaX = 35; int deltaY = 20; int gap = 10;
            int x10 = 429; int x11 = x10 + deltaX;
            int x12 = x11 + gap;
            int x13 = x12 + deltaX;

            int y1 = 410 + deltaY * (6 - Convert.ToInt32(postion));

            g.DrawLine(p, x10 + deltaX * 2 + 10 + 5, y1, x10 + deltaX * 2 + 10 + 10, y1);


        }

      private  void DrawGua()
        {
            Graphics g = this.CreateGraphics();
            Pen p = new Pen(Color.Blue, 6);//定义了一个蓝色,宽度为的画笔
            g.Clear(this.BackColor);

            if (label5.Text == "1")
            {
                drawQian(p, g, true);
                switch (label4.Text)
                {
                    case "1":
                        label7.Text = "乾为天190";
                        drawQian(p, g, false);
                        txtContent.Text = "乾为天:元，亨，利，贞。\r\n彖曰：大哉乾元，万物资始，乃统天。云行雨施，品物流形。大明始终，六位时成，时乘六龙以御天。乾道变化，各正性命，保合大和，乃利贞。首出庶物，万国咸宁。\r\n象曰：天行健，君子以自强不息。\r\n初九: 潜龙，勿用。\r\n象曰：潜龙勿用，阳在下也。\r\n九二: 见龙在田，利见大人。\r\n象曰：见龙再田，德施普也。\r\n九三: 君子终日乾乾，夕惕若，厉，无咎。\r\n象曰：终日乾乾，反复道也。\r\n九四: 或跃在渊，无咎。\r\n象曰：或跃在渊，进无咎也。\r\n九五: 飞龙在天，利见大人。\r\n象曰：飞龙在天，大人造也。\r\n上九: 亢龙有悔。\r\n象曰：亢龙有悔，盈不可久也";
                        break;
                    case "2":
                        drawDui(p, g, false);
                        label7.Text = "天泽履224";
                        drawDui(p, g, false);
                        txtContent.Text = "天泽履:虎尾不垤，人亨。\r\n彖曰：履，柔履刚也。说而应乎乾，是以履虎尾，不咥人，亨。刚中正，履帝位而不疚，光明也。\r\n 象曰：上天下泽，履；君子以辨上下，安民志\r\n 初九: 素履，往，无咎。\r\n 象曰：素履之往，独行愿也。\r\n 九二: 履道坦坦，幽人贞吉。\r\n 象曰：幽人贞吉，中不自乱也。\r\n 六三: 眇能视，跛能履，履虎尾垤，人凶；武人为于大君。\r\n 象曰：眇能视；不足以有明也。跛能履；不足以与行也。咥人之凶；位不当也。 武人为于大君；志刚也。\r\n 九四: 履虎尾，塑塑，终吉。\r\n 象曰：愬愬终吉，志行也。\r\n 九五: 抉履，贞厉。\r\n 象曰：夬履贞厉，位正当也。\r\n 上九: 视履，考祥其旋，元吉。\r\n 象曰：元吉在上，大有庆也";
                        break;
                    case "3":
                        drawLi(p, g, false);
                        label7.Text = "天火同人235";
                        txtContent.Text = "天火同人:于野，亨。利涉大川，利君子贞。\r\n彖曰：同人，柔得位得中，而应乎乾，曰同人。 同人曰，同人于野，亨。利涉大川，乾行也。 文明以健，中正而应，君子正也。 唯君子为能通天下之志。\r\n象曰：天与火，同人；君子以类族辨物。\r\n初九: 同人于门，无咎。\r\n象曰：出门同人，又谁咎也。\r\n六二: 同人于宗，吝。\r\n象曰：同人于宗，吝道也。\r\n九三: 伏戎于莽，升其高陵，三岁不兴。\r\n象曰：伏戎于莽，敌刚也。 三岁不兴，安行也。\r\n九四: 乖其墉，弗克攻，吉。\r\n象曰：乘其墉，义弗克也，其吉，则困而反则也。\r\n九五: 同人先号啕而后笑，大师克相遇。\r\n象曰：同人之先，以中直也。 大师相遇，言相克也。\r\n上九: 同人于郊，无悔。\r\n象曰：同人于郊，志未得也。";
                        break;
                    case "4":
                        label7.Text = "天雷无妄275";
                        drawZhen(p, g, false);
                        txtContent.Text = "天雷无妄:元，亨，利贞。其匪正有眚，不利有攸往。\r\n 彖曰：无妄，刚自外来，而为主於内。动而健，刚中而应，大亨以正，天之命也。 其匪正有眚，不利有攸往。无妄之往，何之矣？ 天命不佑，行矣哉？\r\n 象曰：天下雷行，物与无妄；先王以茂对时，育万物。\r\n初九: 无妄，往，吉。\r\n 象曰：无妄之往，得志也。\r\n六二: 不耕获，不蓄畲。则利有攸往。\r\n 象曰：不耕获，未富也。\r\n六三: 无妄之灾，或系之牛，行人之得，邑人之灾。\r\n 象曰：行人得牛，邑人灾也。\r\n九四: 可贞，无咎。\r\n 象曰：可贞无咎，固有之也。\r\n九五: 无妄之疾，勿药有喜。\r\n 象曰：无妄之药，不可试也。\r\n上九: 无妄行，有眚，无攸利。\r\n 象曰：无妄之行，穷之灾也。";
                        break;
                    case "5":
                        label7.Text = "天风姤343";
                        drawXun(p, g, false);
                        txtContent.Text = "天风姤:女壮，勿用取女。\r\n 彖曰：姤，遇也，柔遇刚也。勿用取女，不可与长也。 天地相遇，品物咸章也。 刚遇中正，天下大行也。 姤之时义大矣哉！\r\n 象曰：天下有风，姤；后以施命诰四方。\r\n 初六: 系于金妮，贞：吉。有攸往，见凶羸豕孚，踟躅。\r\n 象曰：系于金柅，柔道牵也。\r\n 九二: 包有鱼。无咎、不利宾。\r\n 象曰：包有鱼，义不及宾也。\r\n 九三: 臀无肤，其行次且。厉、无大咎。\r\n 象曰：其行次且，行未牵也。\r\n 九四: 包无鱼，起凶。\r\n 象曰：无鱼之凶，远民也。\r\n 九五: 以杞：包瓜含章，有陨自天。\r\n 象曰：九五含章，中正也。 有陨自天，志不舍命也。\r\n 象曰：姤其角，上穷吝也。";
                        break;
                    case "6":
                        label7.Text = "天水讼209";
                        drawKan(p, g, false);
                        txtContent.Text = "天水讼:有孚，窒惕，中吉，终凶。利见大人，不利涉大川。\r\n彖曰：讼，上刚下险，险而健讼。讼有孚窒，惕中吉，刚来而得中也。终凶；讼不可成也。 利见大人；尚中正也。不利涉大川；入于渊也。\r\n象曰：天与水违行，讼；君子以作事谋始。\r\n初六: 不永所事，小有言，终吉。\r\n象曰：不永所事，讼不可长也。 虽有小言，其辩明也。\r\n九二: 不克讼，归而逋，其邑人三百户无眚。\r\n象曰：不克讼，归而逋也。 自下讼上，患至掇也。\r\n六三: 食旧德，贞：厉，终吉，或从王事无成。\r\n象曰：食旧德，从上吉也。\r\n九四: 不克讼，复即命：渝安。贞：吉。\r\n象曰：复即命，渝安贞；不失也。\r\n九五: 讼，元吉。\r\n象曰：讼元吉，以中正也。\r\n上九: 或锡之鞶带，终朝三褫之。\r\n象曰：以讼受服，亦不足敬也。";
                        break;
                    case "7":
                        label7.Text = "天山遁306";
                        drawGen(p, g, false);
                        txtContent.Text = "天山遁:亨小，利贞。\r\n彖曰：遯亨，遯而亨也。 刚当位而应，与时行也。 小利贞，浸而长也。遯之时义大矣哉！\r\n象曰：天下有山，遯；君子以远小人，不恶而严。\r\n初六: 遁尾厉，勿用有攸往。\r\n象曰：遯尾之厉，不往何灾也。\r\n六二: 执之用黄牛之革，莫之胜说。\r\n象曰：执用黄牛，固志也。\r\n九三: 系遁，有疾厉畜臣妾，吉。\r\n象曰：系遯之厉，有疾惫也。 畜臣妾吉，不可大事也。\r\n九四: 好遁。君子吉，小人否。\r\n象曰：君子好遯，小人否也。\r\n九五: 嘉遁。贞：吉。\r\n象曰：嘉遯贞吉，以正志也。\r\n上九: 肥遁。无不利。\r\n象曰：肥遯，无不利；无所疑也。";
                        break;
                    case "8":
                        label7.Text = "天地否231";
                        drawKun(p, g, false);
                        txtContent.Text = "";
                        break;
                    default:
                        break;
                }

            }
            else if (label5.Text == "2")
            {
                drawDui(p, g, true);
                switch (label4.Text)
                {
                    case "1":
                        drawQian(p, g, false);
                        label7.Text = "泽天夬224";
                        txtContent.Text = "泽天夬:扬于王庭。孚号有厉，告自邑：“不利即戎，利有攸往。”\r\n彖曰：夬，决也，刚决柔也。健而说，决而和，扬于王庭，柔乘五刚也。孚号有厉，其危乃光也。 告自邑，不利即戎，所尚乃穷也。 利有攸往，刚长乃终也。\r\n象曰：泽上于天，夬；君子以施禄及下，居德则忌。\r\n初九: 壮于前趾，往，不胜，为咎。\r\n象曰：不胜而往，咎也。\r\n九二: 惕号：“莫夜有戎，勿恤。”\r\n象曰：莫夜有戎，得中道也。\r\n九三: 壮于顷，有凶。君子抉抉独行，遇雨若濡。有愠，无咎。\r\n象曰：君子夬夬，终无咎也。\r\n九四: 臀无肤，其行次且，牵羊悔亡，闻言不信。\r\n象曰：其行次且，位不当也。 闻言不信，聪不明也。\r\n九五: 苋陆抉抉中行。无咎。\r\n象曰：中行无咎，中未光也。\r\n上六: 无号，终有凶。\r\n象曰：无号之凶，终不可长也。";
                        break;
                    case "2":
                        drawDui(p, g, false);
                        label7.Text = "兑为泽389";
                        txtContent.Text = "兑为泽:亨。利贞。\r\n彖曰：兑，说也。 刚中而柔外，说以利贞，是以顺乎天，而应乎人。 说以先民，民忘其劳；说以犯难，民忘其死；说之大，民劝矣哉！\r\n象曰：丽泽，兑；君子以朋友讲习。\r\n初九: 和兑。吉。\r\n象曰：和兑之吉，行未疑也。\r\n九二: 孚兑，吉、悔亡。\r\n象曰：孚兑之吉，信志也。\r\n六三: 来兑，凶。\r\n象曰：来兑之凶，位不当也。\r\n九四: 商兑未宁，介疾有喜。\r\n象曰：九四之喜，有庆也。\r\n九五: 孚于剥，有厉。\r\n象曰：孚于剥，位正当也。\r\n上六: 引兑。\r\n象曰：上六引兑，未光也";
                        break;
                    case "3":
                        drawLi(p, g, false);
                        label7.Text = "泽火革359";
                        txtContent.Text = "泽火革:巳日乃孚，元亨，利贞。悔亡。\r\n彖曰：革，水火相息，二女同居，其志不相得，曰革。己日乃孚；革而信也。 文明以说，大亨以正，革而当，其悔乃亡。天地革而四时成，汤武革命，顺乎天而应乎人，革之时义大矣哉！\r\n象曰：泽中有火，革；君子以治历明时。\r\n初九: 巩用黄牛之革。\r\n象曰：巩用黄牛，不可以有为也。\r\n六二: 巳日乃革之，征吉、无咎。\r\n象曰：己日革之，行有嘉也。\r\n九三: 征凶，贞：厉。革言三就，有孚。\r\n象曰：革言三就，又何之矣。\r\n九四: 悔亡。有孚改命。吉。\r\n象曰：改命之吉，信志也。\r\n九五: 大人虎变，未占有孚。\r\n象曰：大人虎变，其文炳也。\r\n上六: 君子豹变，小人革西。征凶。居贞：吉。\r\n象曰：君子豹变，其文蔚也。 小人革面，顺以从君也。";
                        break;
                    case "4":
                        drawZhen(p, g, false);
                        label7.Text = "泽雷随249";
                        txtContent.Text = "泽雷随:元亨，利贞。无咎。\r\n彖曰：随，刚来而下柔，动而说，随。大亨贞，无咎，而天下随时，随之时义大矣哉！\r\n象曰：泽中有雷，随；君子以晦入宴息。\r\n初九: 官有渝：贞吉、出门交有功。\r\n象曰：官有渝，从正吉也。 出门交有功，不失也。\r\n六二: 系小子，失丈夫。\r\n象曰：系小子，弗兼与也。\r\n六三: 系丈夫，失小子。随有求得。利居贞。\r\n象曰：系丈夫，志舍下也。\r\n九四: 随有获。贞：凶。有孚在道，以明何咎。\r\n象曰：随有获，其义凶也。 有孚在道，明功也。\r\n九五: 孚于嘉。吉。\r\n象曰：孚于嘉，吉；位正中也。\r\n上六: 拘系之，乃从维之，王用亨于西山。\r\n象曰：拘系之，上穷也。";
                        break;
                    case "5":
                        drawXun(p, g, false);
                        label7.Text = "泽风大过286";
                        txtContent.Text = "泽风大过:栋桡，利有攸往，亨。\r\n 彖曰：大过，大者过也。 栋桡，本末弱也。 刚过而中，巽而说行，利有攸往，乃亨。 大过之时义大矣哉！\r\n 象曰：泽灭木，大过；君子以独立不惧，遯世无闷。\r\n初六: 籍用百茅。无咎。\r\n 象曰：藉用白茅，柔在下也。\r\n九二: 枯杨生梯，老夫得其女妻，无不利。\r\n 象曰：老夫女妻，过以相与也。\r\n九三: 栋桡。凶。\r\n 象曰：栋桡之凶，不可以有辅也。\r\n九四: 栋隆，吉。有它，吝。\r\n 象曰：栋隆之吉，不桡乎下也。\r\n九五: 枯杨生华，老妇得其士夫，无咎无誉。\r\n 象曰：枯杨生华，何可久也。 老妇士夫，亦可丑也。\r\n上六: 过涉灭顶，凶，无咎。\r\n 象曰：过涉之凶，不可咎也。";
                        break;
                    case "6":
                        drawKan(p, g, false);
                        label7.Text = "泽水困352";
                        txtContent.Text = "泽水困:亨，贞：大人吉、无咎。有言不信。\r\n彖曰：困，刚掩也。 险以说，困而不失其所，亨；其唯君子乎？ 贞大人吉，以刚中也。 有言不信，尚口乃穷也。\r\n象曰：泽无水，困；君子以致命遂志。\r\n初六: 臀困于株木，入于幽谷，三岁不觌。\r\n象曰：入于幽谷，幽不明也。\r\n九二: 困于酒食，朱绂方来。利用亨祀。征凶。无咎。\r\n象曰：困于酒食，中有庆也。\r\n六三: 困于石，据于蒺藜，入于其宫，不见其妻。凶。\r\n象曰：据于蒺藜，乘刚也。 入于其宫，不见其妻，不祥也。\r\n九四: 来徐徐，困于金车。吝，有终。\r\n象曰：来徐徐，志在下也。 虽不当位，有与也。\r\n九五: 劓刖，困于赤绂，乃徐有说，利用祭祀。\r\n象曰：劓刖，志未得也。乃徐有说，以中直也。利用祭祀，受福也。\r\n上六: 困于葛，藟于臲？。曰：动悔有悔！征：吉。\r\n象曰：困于葛藟，未当也。 动悔，有悔吉，行也。";
                        break;
                    case "7":
                        drawGen(p, g, false);
                        label7.Text = "泽山咸299";
                        txtContent.Text = "天山遁:亨小，利贞。\r\n 彖曰：遯亨，遯而亨也。 刚当位而应，与时行也。 小利贞，浸而长也。遯之时义大矣哉！\r\n 象曰：天下有山，遯；君子以远小人，不恶而严。\r\n初六: 遁尾厉，勿用有攸往。\r\n 象曰：遯尾之厉，不往何灾也。\r\n六二: 执之用黄牛之革，莫之胜说。\r\n 象曰：执用黄牛，固志也。\r\n九三: 系遁，有疾厉畜臣妾，吉。\r\n 象曰：系遯之厉，有疾惫也。 畜臣妾吉，不可大事也。\r\n九四: 好遁。君子吉，小人否。\r\n 象曰：君子好遯，小人否也。\r\n九五: 嘉遁。贞：吉。\r\n 象曰：嘉遯贞吉，以正志也。\r\n上九: 肥遁。无不利。\r\n 象曰：肥遯，无不利；无所疑也。";
                        break;
                    case "8":
                        drawKun(p, g, false);
                        label7.Text = "泽地萃346";
                        txtContent.Text = "泽地萃:亨，王假有庙，利见大人，亨，利贞。用大牲，吉。利有攸往。\r\n 彖曰：萃，聚也；顺以说，刚中而应，故聚也。王假有庙，致孝享也。利见大人亨，聚以正也。 用大牲吉，利有攸往，顺天命也。 观其所聚，而天地万物之情可见矣。\r\n 象曰：泽上於地，萃；君子以除戎器，戒不虞。\r\n 初六: 有孚不终，乃乱乃萃，若号一握为笑，勿恤，往，无咎。\r\n 象曰：乃乱乃萃，其志乱也。\r\n 六二: 引，吉、无咎。孚乃利用瀹。\r\n 象曰：引吉无咎，中未变也。\r\n 六三: 萃如嗟如，无攸利。往，无咎、小吝。\r\n 象曰：往无咎，上巽也。\r\n 九四: 大吉、无咎。\r\n 象曰：大吉无咎，位不当也。\r\n 九五: 萃有位，无咎。匪孚，元永贞，悔亡。\r\n 象曰：萃有位，志未光也。\r\n 上六: 赍咨涕咦，无咎。\r\n 象曰：齎咨涕洟，未安上也。";
                        break;
                    default:
                        break;
                }

            }
            else if (label5.Text == "3")
            {
                drawLi(p, g, true);
                switch (label4.Text)
                {
                    case "1":
                        drawQian(p, g, false);
                        label7.Text = "火天大有238";
                        txtContent.Text = "火天大有:元亨。\r\n彖曰：大有，柔得尊位，大中而上下应之，曰大有。其德刚健而文明，应乎天而时行，是以元亨。\r\n象曰：火在天上，大有；君子以竭恶扬善，顺天休命。\r\n初九: 无交害，匪咎艰，则无咎。\r\n象曰：大有初九，无交害也。\r\n九二: 大车以载，有攸往。无咎。\r\n象曰：大车以载，积中不败也。\r\n九三: 公用亨于天子，小人弗克。\r\n象曰：公用亨于天子，小人害也。\r\n九四: 匪其彭。无咎。\r\n象曰：匪其彭，无咎；明辨晰也。\r\n六五: 厥孚、交如、威如，吉。\r\n象曰：厥孚交如，信以发志也。 威如之吉，易而无备也。\r\n上九: 自天佑之。吉，无不利。\r\n象曰：大有上吉，自天佑也。";
                        break;
                    case "2":
                        drawDui(p, g, false);
                        label7.Text = "火泽睽321";
                        txtContent.Text = "火泽睽:小事，吉。\r\n彖曰：睽，火动而上，泽动而下； 二女同居，其志不同行；说而丽乎明，柔进而上行，得中而应乎刚；是以小事吉。 天地睽，而其事同也；男女睽，而其志通也；万物睽，而其事类也；睽之时用大矣哉！\r\n象曰：上火下泽，睽；君子以同而异。\r\n初九: 悔亡。丧马勿逐，自复。见恶人，无咎。\r\n象曰：见恶人，以辟咎也。\r\n九二: 遇主于巷，无咎。\r\n象曰：遇主于巷，未失道也。\r\n六三: 见舆曳，其牛擎，其人天且劓。无初有终。\r\n象曰：见舆曳，位不当也。 无初有终，遇刚也。\r\n九四: 睽孤，遇元夫，交孚。厉、无咎。\r\n象曰：交孚无咎，志行也。\r\n六五: 悔亡，厥宗噬肤，往，何咎？\r\n象曰：厥宗噬肤，往有庆也。\r\n上九: 睽孤，见豕负涂，载鬼一车。先张之弧，后说之弧，匪寇，婚媾，往，遇雨，则吉。\r\n象曰：遇雨之吉，群疑亡也。";
                        break;
                    case "3":
                        drawLi(p, g, false);
                        label7.Text = "离为火294";
                        txtContent.Text = "离为火:利贞，亨，畜牝牛，吉。\r\n 彖曰：离，丽也；日月丽乎天，百谷草木丽乎土，重明以丽乎正，乃化成天下。 柔丽乎中正，故亨；是以畜牝牛吉也。\r\n 象曰：明两作离，大人以继明照于四方。\r\n初九: 履错然敬之，无咎。\r\n 象曰：履错之敬，以辟咎也。\r\n六二: 黄离，元吉。\r\n 象曰：黄离元吉，得中道也。\r\n九三: 日昃之离，不鼓缶而歌，则大耋之嗟。凶。\r\n 象曰：日昃之离，何可久也。\r\n九四: 突如其来如、焚如、死如、弃如。\r\n 象曰：突如其来如，无所容也。\r\n六五: 出涕沱若，戚嗟若。吉。\r\n 象曰：六五之吉，离王公也。\r\n上九: 王用出征，有嘉折首，获匪其丑。无咎。\r\n 象曰：王用出征，以正邦也。";
                        break;
                    case "4":
                        drawZhen(p, g, false);
                        label7.Text = "火雷噬嗑261";
                        txtContent.Text = "天雷无妄:元，亨，利贞。其匪正有眚，不利有攸往。\r\n彖曰：无妄，刚自外来，而为主於内。动而健，刚中而应，大亨以正，天之命也。 其匪正有眚，不利有攸往。无妄之往，何之矣？ 天命不佑，行矣哉？\r\n象曰：天下雷行，物与无妄；先王以茂对时，育万物。\r\n初九: 无妄，往，吉。\r\n象曰：无妄之往，得志也。\r\n六二: 不耕获，不蓄畲。则利有攸往。\r\n象曰：不耕获，未富也。\r\n六三: 无妄之灾，或系之牛，行人之得，邑人之灾。\r\n象曰：行人得牛，邑人灾也。\r\n九四: 可贞，无咎。\r\n象曰：可贞无咎，固有之也。\r\n九五: 无妄之疾，勿药有喜。\r\n象曰：无妄之药，不可试也。\r\n上九: 无妄行，有眚，无攸利。\r\n象曰：无妄之行，穷之灾也。";
                        break;
                    case "5":
                        drawXun(p, g, false);
                        label7.Text = "火风鼎362";
                        txtContent.Text = "火风鼎:元吉、亨。\r\n彖曰：鼎，象也。 以木巽火，亨饪也。 圣人亨以享上帝，而大亨以养圣贤。 巽而耳目聪明，柔进而上行，得中而应乎刚，是以元亨。\r\n象曰：木上有火，鼎；君子以正位凝命。\r\n初六: 鼎颠趾，利出否，得妾以其子，无咎。\r\n象曰：鼎颠趾，未悖也。 利出否，以从贵也。\r\n九二: 鼎有实，我仇有疾不？我能即，吉。\r\n象曰：鼎有实，慎所之也。 我仇有疾，终无尤也。\r\n九三: 鼎耳革，其行塞，雉膏不食，方雨，亏悔，终吉。\r\n象曰：鼎耳革，失其义也。\r\n九四: 鼎折足，覆公涑，其形渥。凶。\r\n象曰：覆公餗，信如何也。\r\n六五: 鼎黄耳、金铉，利贞。\r\n象曰：鼎黄耳，中以为实也。\r\n上九: 鼎玉铉。大吉、无不利。\r\n象曰：玉铉在上，刚柔节也。";
                        break;
                    case "6":
                        drawKan(p, g, false);
                        label7.Text = " 火水未济412";
                        txtContent.Text = "火水未济:亨，小狐汔济，濡其尾。无攸利。\r\n彖曰：未济，亨；柔得中也。 小狐汔济，未出中也。 濡其尾，无攸利；不续终也。 虽不当位，刚柔应也。\r\n象曰：火在水上，未济；君子以慎辨物居方。\r\n初六: 濡其尾。吝。\r\n象曰：濡其尾，亦不知极也。\r\n九二: 曳其轮，贞：吉。\r\n象曰：九二贞吉，中以行正也。\r\n六三: 未济，征凶。利涉大川。\r\n象曰：未济征凶，位不当也。\r\n九四: 贞：吉、悔亡。震用伐鬼方三年，有赏于大国。\r\n象曰：贞吉悔亡，志行也。\r\n六五: 贞：吉、无悔。君子之光，有孚。吉。\r\n象曰：君子之光，其晖吉也。\r\n上九: 有孚于饮酒。无咎。濡其首有孚，失是。\r\n象曰：饮酒濡首，亦不知节也。";
                        break;
                    case "7":
                        drawGen(p, g, false);
                        label7.Text = "火山旅383";
                        txtContent.Text = "火山旅:小亨。旅，贞：吉。\r\n彖曰：旅，小亨，柔得中乎外，而顺乎刚，止而丽乎明，是以小亨，旅贞吉也。 旅之时义大矣哉！\r\n象曰：山上有火，旅；君子以明慎用刑，而不留狱。\r\n初六: 旅琐琐，斯其所取灾。\r\n象曰：旅琐琐，志穷灾也。\r\n六二: 旅即次，怀其资，得童仆。贞。\r\n象曰：得童仆贞，终无尤也。\r\n九三: 旅焚其次，丧其童仆。贞：厉。\r\n象曰：旅焚其次，亦以伤矣。 以旅与下，其义丧也。\r\n九四: 旅于处，得其资斧，我心不快。\r\n象曰：旅于处，未得位也。 得其资斧，心未快也。\r\n六五: 射雉，一矢亡，终以誉命。\r\n象曰：终以誉命，上逮也。\r\n上九: 鸟焚其巢，旅人先小后号啕，丧牛于易。凶。\r\n象曰：以旅在上，其义焚也。 丧牛于易，终莫之闻也。";
                        break;
                    case "8":
                        drawKun(p, g, false);
                        label7.Text = "火地晋312";
                        txtContent.Text = "火地晋:康侯用锡马蕃庶，昼日三接。\r\n彖曰：晋，进也。 明出地上，顺而丽乎大明，柔进而上行。 是以康侯用锡马蕃庶，昼日三接也。\r\n象曰：明出地上，晋；君子以自昭明德。\r\n初六: 晋如摧如。贞：吉。罔孚裕，无咎。\r\n象曰：晋如，摧如；独行正也。\r\n六二: 晋如愁如。贞：吉。受兹介福于其王母。\r\n象曰：受之介福，以中正也。\r\n六三: 众允。悔亡。\r\n象曰：众允之，志上行也。\r\n九四: 晋如，鼢鼠。贞：厉。\r\n象曰：硕鼠贞厉，位不当也。\r\n六五: 悔亡。失得勿恤。往：吉、无不利。\r\n象曰：失得勿恤，往有庆也。\r\n上九: 晋其角，维用伐邑。厉、吉、无咎。贞：吝。\r\n象曰：维用伐邑，道未光也。";
                        break;
                    default:
                        break;
                }

            }
            else if (label5.Text == "4")
            {
                drawZhen(p, g, true);
                switch (label4.Text)
                {
                    case "1":
                        drawQian(p, g, false);
                        label7.Text = "雷天大壮309";
                        txtContent.Text = "雷天大壮:利贞。\r\n 彖曰：大壮，大者壮也。 刚以动，故壮。 大壮利贞；大者正也。正大而天地之情可见矣！\r\n 象曰：雷在天上，大壮；君子以非礼勿履。\r\n初九: 壮于趾，征凶，有孚。\r\n 象曰：壮于趾，其孚穷也。\r\n九二: 贞：吉。\r\n 象曰：九二贞吉，以中也。\r\n九三: 小人用壮，君子用罔。贞：厉。羝羊触藩，羸其角。\r\n 象曰：小人用壮，君子罔也。\r\n九四: 贞：吉，悔亡。藩决不羸。壮于大舆之辐。\r\n 象曰：藩决不羸，尚往也。\r\n六五: 丧羊于易。无悔。\r\n 象曰：丧羊于易，位不当也。\r\n上六: 羝羊触藩，不能退，不能遂，无攸利，艰则吉。\r\n 象曰：不能退，不能遂，不祥也。 艰则吉，咎不长也。";
                        break;
                    case "2":
                        drawDui(p, g, false);
                        label7.Text = "雷泽归妹375";
                        txtContent.Text = "雷泽归妹:征凶，无攸利。\r\n 彖曰：归妹，天地之大义也。天地不交，而万物不兴，归妹人之终始也。说以动，所归妹也。 征凶，位不当也。 无攸利，柔乘刚也。\r\n 象曰：泽上有雷，归妹；君子以永终知敝。\r\n初九: 归妹以娣，跛能履，征吉。\r\n 象曰：归妹以娣，以恒也。 跛能履吉，相承也。\r\n九二: 眇能视。利幽人之贞。\r\n 象曰：利幽人之贞，未变常也。\r\n六三: 归妹以须，反归以娣。\r\n 象曰：归妹以须，未当也。\r\n九四: 归妹愆期，迟归有时。\r\n 象曰：愆期之志，有待而行也。\r\n六五: 帝乙归妹，其君之袂不如其娣之袂良。月几望，吉。\r\n 象曰：帝乙归妹，不如其娣之袂良也。 其位在中，以贵行也。\r\n上六: 女承筐无实，士封羊无血，无攸利。\r\n象曰：上六无实，承虚筐也。";
                        break;
                    case "3":
                        drawLi(p, g, false);
                        label7.Text = "雷火丰379";
                        txtContent.Text = "雷火丰:亨，王假之，勿忧，宜日中。\r\n彖曰：丰，大也。 明以动，故丰。王假之，尚大也。 勿忧宜日中，宜照天下也。日中则昃，月盈则食，天地盈虚，与时消息，而况人於人乎？况於鬼神乎？\r\n象曰：雷电皆至，丰；君子以折狱致刑。\r\n初九: 遇其配主，虽旬，无咎。往有尚。\r\n象曰：虽旬无咎，过旬灾也。\r\n六二: 丰其蒿，日中见斗，往。得疑疾，有孚发若。吉。\r\n象曰：有孚发若，信以发志也。\r\n九三: 丰其沛，日中见沫，折其右肱。无咎。\r\n象曰：丰其沛，不可大事也。 折其右肱，终不可用也。\r\n九四: 丰其蒿，日中见斗，遇其夷主。吉。\r\n象曰：丰其蔀，位不当也。 日中见斗，幽不明也。 遇其夷主，吉；行也。\r\n六五: 来章有庆，誉。吉。\r\n象曰：六五之吉，有庆也。\r\n上六: 丰其屋，蒿其家，窥其户，阒其无人，三岁不觌。凶。\r\n象曰：丰其屋，天际翔也。 窥其户，闃其无人，自藏也。";
                        break;
                    case "4":
                        drawZhen(p, g, false);
                        label7.Text = "震为雷365";
                        txtContent.Text = "震为雷:亨。震来虩虩，笑言哑哑，震惊百里，不丧匕鬯。\r\n彖曰：震，亨。 震来虩虩，恐致福也。笑言哑哑，后有则也。 震惊百里，惊远而惧迩也。 出可以守宗庙社稷，以为祭主也。\r\n象曰：洊雷，震；君子以恐惧修身。\r\n初九: 震来虩虩，后笑言哑哑。吉。\r\n象曰：震来虩虩，恐致福也。 笑言哑哑，后有则也。\r\n六二: 震来厉，亿丧贝、跻于九陵，勿逐七日，得。\r\n象曰：震来厉，乘刚也。\r\n六三: 震苏苏，震行无眚。\r\n象曰：震苏苏，位不当也。\r\n九四: 震遂泥。\r\n象曰：震遂泥，未光也。\r\n六五: 震往来厉，亿无丧，有事。\r\n象曰：震往来厉，危行也。 其事在中，大无丧也。\r\n上六: 震索索，视矍矍，征凶。震不于其躬，于其邻，无咎。婚媾有言。\r\n象曰：震索索，未得中也。 虽凶无咎，畏邻戒也。";
                        break;
                    case "5":
                        drawXun(p, g, false);
                        label7.Text = "雷风恒302";
                        txtContent.Text = "雷风恒:亨，无咎，利贞。利有攸往。\r\n彖曰：恒，久也。 刚上而柔下，雷风相与，巽而动，刚柔皆应，恒。 恒亨无咎，利贞； 久於其道也，天地之道，恒久而不已也。 利有攸往，终则有始也。日月得天，而能久照，四时变化，而能久成，圣人久於其道，而天下化成；观其所恒，而天地万物之情可见矣！\r\n象曰：雷风，恒；君子以立不易方。\r\n初六: 浚恒。贞：凶，无攸利。\r\n象曰：浚恒之凶，始求深也。\r\n九二: 悔亡。\r\n象曰：九二悔亡，能久中也。\r\n九三: 不恒其德，或承之羞。贞：吝。\r\n象曰：不恒其德，无所容也。\r\n九四: 田无禽。\r\n象曰：久非其位，安得禽也。\r\n六五: 恒其德。贞：妇人吉，夫子凶。\r\n象曰：妇人贞吉，从一而终也。 夫子制义，从妇凶也。\r\n上六: 振恒，凶。\r\n象曰：振恒在上，大无功也";
                        break;
                    case "6":
                        drawKan(p, g, false);
                        label7.Text = "雷水解329";
                        txtContent.Text = "雷水解:利西南。无所往，其来复，吉。有攸往夙，吉。\r\n彖曰：解，险以动，动而免乎险，解。 解利西南，往得众也。其来复吉，乃得中也。有攸往夙吉，往有功也。 天地解，而雷雨作，雷雨作，而百果草木皆甲坼，解之时义大矣哉！\r\n象曰：雷雨作，解；君子以赦过宥罪。\r\n初六: 无咎。\r\n象曰：刚柔之际，义无咎也。\r\n九二: 田获三狐，得黄矢。贞：吉。\r\n象曰：九二贞吉，得中道也。\r\n六三: 负且乘，致寇至。贞：吝。\r\n象曰：负且乘，亦可丑也，自我致戎，又谁咎也。\r\n九四: 解而拇，朋至斯孚。\r\n象曰：解而拇，未当位也。\r\n六五: 君子维有解，吉。有孚于小人。\r\n象曰：君子有解，小人退也。\r\n上六: 公用射隼于高墉之上，获之，无不利。\r\n象曰：公用射隼，以解悖也。";
                        break;
                    case "7":
                        drawGen(p, g, false);
                        label7.Text = "雷山大过286";
                        txtContent.Text = "雷山小过:亨，利贞。可小事，不可大事。飞鸟遗之音，不宜上，宜下。大吉。\r\n彖曰：小过，小者过而亨也。 过以利贞，与时行也。 柔得中，是以小事吉也。 刚失位而不中，是以不可大事也。 有飞鸟之象焉，有飞鸟遗之音，不宜上宜下，大吉；上逆而下顺也。\r\n象曰：山上有雷，小过；君子以行过乎恭，丧过乎哀，用过乎俭。\r\n初六: 飞鸟以凶。\r\n象曰：飞鸟以凶，不可如何也。\r\n六二: 过其祖，遇其妣，不及其君，遇其臣。无咎。\r\n象曰：不及其君，臣不可过也。\r\n九三: 弗过防之，从或戕之。凶。\r\n象曰：从或戕之，凶如何也。\r\n九四: 无咎。弗过遇之。往厉，必戒。勿用永贞。\r\n象曰：弗过遇之，位不当也。 往厉必戒，终不可长也。\r\n六五: 密云不雨，自我西郊，公戈取彼在穴。\r\n象曰：密云不雨，已上也。\r\n上六: 弗遇过之，飞鸟离之，凶，是谓灾眚。\r\n象曰：弗遇过之，已亢也。";
                        break;
                    case "8":
                        drawKun(p, g, false);
                        label7.Text = "雷地豫246";
                        txtContent.Text = "雷地豫:利建侯、行师。\r\n彖曰：豫，刚应而志行，顺以动，豫。豫，顺以动，故天地如之，而况建侯行师乎？天地以顺动，故日月不过，而四时不忒；圣人以顺动，则刑罚清而民服。 豫之时义大矣哉！\r\n象曰：雷出地奋，豫。 先王以作乐崇德，殷荐之上帝，以配祖考。\r\n初六: 鸣豫，凶。\r\n象曰：初六鸣豫，志穷凶也。\r\n六二: 介于石，不终日。贞：吉。\r\n象曰：不终日，贞吉；以中正也。\r\n六三: 盱豫，悔；迟，有悔。\r\n象曰：盱豫有悔，位不当也。\r\n九四: 由豫，大有得，勿疑朋盍簪。\r\n象曰：由豫，大有得；志大行也。\r\n六五: 贞：疾恒，不死。\r\n象曰：六五贞疾，乘刚也。 恒不死，中未亡也。\r\n上六: 冥豫，成有渝。无咎。\r\n象曰：冥豫在上，何可长也。";
                        break;
                    default:
                        break;
                }

            }
            else if (label5.Text == "5")
            {
                drawXun(p, g, true);
                switch (label4.Text)
                {
                    case "1":
                        drawQian(p, g, false);
                        label7.Text = "风天小畜221";
                        txtContent.Text = "风天小畜:亨。密云不雨，自我西郊。\r\n彖曰：小畜； 柔得位，而上下应之，曰小畜。 健而巽，刚中而志行，乃亨。 密云不雨，尚往也。 自我西郊，施未行也。\r\n象曰：风行天上，小畜；君子以懿文德。\r\n初九: 复其道，何其咎？吉。\r\n象曰：复自道，其义吉也。\r\n九二: 牵复。吉。\r\n象曰：牵复在中，亦不自失也。\r\n九三: 舆说辐，夫妻反目。\r\n象曰：夫妻反目，不能正室也。\r\n六四: 有孚，血去惕出。无咎。\r\n象曰：有孚惕出，上合志也。\r\n九五: 有孚挛如，富以其邻。\r\n象曰：有孚挛如，不独富也。\r\n上九: 既雨既处，尚德载。妇贞：厉。月几望，君子征，凶。\r\n象曰：既雨既处，德积载也。 君子征凶，有所疑也。";
                        break;
                    case "2":
                        drawDui(p, g, false);
                        label7.Text = "风泽中孚400";
                        txtContent.Text = "风泽中孚:豚、鱼。吉、利涉大川、利贞。\r\n彖曰：中孚，柔在内而刚得中。 说而巽，孚，乃化邦也。 豚鱼吉，信及豚鱼也。 利涉大川，乘木舟虚也。 中孚以利贞，乃应乎天也。\r\n象曰：泽上有风，中孚；君子以议狱缓死。\r\n初九: 虞。吉。有它不燕。\r\n象曰：初九虞吉，志未变也。\r\n九二: 鸣鹤在阴，其子和之；我有好爵，吾与尔靡之。\r\n象曰：其子和之，中心愿也。\r\n六三: 得敌，或鼓或罢，或泣或歌。\r\n象曰：可鼓或罢，位不当也。\r\n六四: 月几望，马匹亡，无咎。\r\n象曰：马匹亡，绝类上也。\r\n九五: 有孚挛如，无咎。\r\n象曰：有孚挛如，位正当也。\r\n上九: 翰音登于天。贞：凶。\r\n象曰：翰音登于天，何可长也。";
                        break;
                    case "3":
                        drawLi(p, g, false);
                        label7.Text = "风火家人318";
                        txtContent.Text = "风火家人:利女贞。\r\n彖曰：家人，女正位乎内，男正位乎外，男女正，天地之大义也。家人有严君焉，父母之谓也。父父，子子，兄兄，弟弟，夫夫，妇妇，而家道正；正家而天下定矣。\r\n象曰：风自火出，家人；君子以言有物，而行有恒。\r\n初九: 闲有家。悔亡。\r\n象曰：闲有家，志未变也。\r\n六二: 无攸遂，在中，馈。贞：吉。\r\n象曰：六二之吉，顺以巽也。\r\n九三: 家人喑喑。悔、厉、吉。妇子嘻嘻。终吝。\r\n象曰：家人嗃嗃，未失也；妇子嘻嘻，失家节也。\r\n六四: 富家，大吉。\r\n象曰：富家大吉，顺在位也。\r\n九五: 王假有家，勿恤。吉。\r\n象曰：王假有家，交相爱也。\r\n上九: 有孚威如，终吉。\r\n象曰：威如之吉，反身之谓也";
                        break;
                    case "4":
                        drawZhen(p, g, false);
                        label7.Text = "风雷益337";
                        txtContent.Text = "风雷益:利有攸往，利涉大川。\r\n彖曰：益，损上益下，民说无疆，自上下下，其道大光。利有攸往，中正有庆。 利涉大川，木道乃行。 益动而巽，日进无疆。 天施地生，其益无方。 凡益之道，与时偕行。\r\n象曰：风雷，益；君子以见善则迁，有过则改。\r\n初九: 利用为大作。元吉、无咎。\r\n象曰：元吉无咎，下不厚事也。\r\n六二: 或益之十朋之龟，弗克违，永贞吉。王用亨于帝。吉。\r\n象曰：或益之，自外来也。\r\n六三: 益之用凶事。无咎。有孚中行，告公用圭。\r\n象曰：益用凶事，固有之也。\r\n六四: 中行告公，从，利用为依迁国。\r\n象曰：告公从，以益志也。\r\n九五: 有孚惠心，勿问，元吉。有孚惠我，德。\r\n象曰：有孚惠心，勿问之矣。 惠我德，大得志也。\r\n上九: 莫益之，或击之，立心勿恒，凶。\r\n象曰：莫益之，偏辞也。 或击之，自外来也。";
                        break;
                    case "5":
                        drawXun(p, g, false);
                        label7.Text = "巽为风386";
                        txtContent.Text = "巽为风:小亨。利有攸往，利见大人。\r\n彖曰：重巽以申命，刚巽乎中正而志行。柔皆顺乎刚，是以小亨，利有攸往，利见大人。\r\n象曰：随风，巽；君子以申命行事。\r\n初六: 进退，利武人之贞。\r\n象曰：进退，志疑也。 利武人之贞，志治也。\r\n九二: 巽在床下用，史巫纷若。吉、无咎。\r\n象曰：纷若之吉，得中也。\r\n九三: 频巽。吝。\r\n象曰：频巽之吝，志穷也。\r\n六四: 悔亡。田获三品。\r\n象曰：田获三品，有功也。\r\n九五: 贞：吉、悔亡、无不利。无初有终，先庚三日，后庚三日。吉。\r\n象曰：九五之吉，位正中也。\r\n上九: 巽在床下，丧其资斧。贞：凶。\r\n象曰：巽在牀下，上穷也。 丧其资斧，正乎凶也。";
                        break;
                    case "6":
                        drawKan(p, g, false);
                        label7.Text = "风水涣394";
                        txtContent.Text = "风水涣:亨，王假有庙。利涉大川、利贞。\r\n彖曰：涣，亨。 刚来而不穷，柔得位乎外而上同。 王假有庙，王乃在中也。 利涉大川，乘木有功也。\r\n象曰：风行水上，涣；先王以享于帝立庙。\r\n初六: 用拯马壮。吉。\r\n象曰：初六之吉，顺也。\r\n九二: 涣奔其机。悔亡。\r\n象曰：涣奔其机，得愿也。\r\n六三: 涣其躬。无悔。\r\n象曰：涣其躬，志在外也。\r\n六四: 涣其群。元吉。涣有丘，匪夷所思。\r\n象曰：涣其群，元吉；光大也。\r\n九五: 换汗其大号。涣王居。无咎。\r\n象曰：王居无咎，正位也。\r\n上九: 涣其血去逖出。无咎。\r\n象曰：涣其血，远害也。";
                        break;
                    case "7":
                        drawGen(p, g, false);
                        label7.Text = "风山渐372";
                        txtContent.Text = "风山渐:女归，吉，利贞。\r\n彖曰：渐之进也，女归吉也。 进得位，往有功也。进以正，可以正邦也。其位刚，得中也。 止而巽，动不穷也。\r\n象曰：山上有木，渐；君子以居贤德，善俗。\r\n初六: 鸿渐于干，小子厉，有言。无咎。\r\n象曰：小子之厉，义无咎也。\r\n六二: 鸿渐于磬，饮食衍衍。吉。\r\n象曰：饮食衎衎，不素饱也。\r\n九三: 鸿渐于陆；夫征不复，妇孕不育，凶。利御寇。\r\n象曰：夫征不复，离群丑也。 妇孕不育，失其道也。利用御寇，顺相保也。\r\n六四: 鸿渐于木；或得其桷。无咎。\r\n象曰：或得其桷，顺以巽也。\r\n九五: 鸿渐于陵；妇三岁不孕，终莫之胜。\r\n象曰：终莫之胜，吉；得所愿也。\r\n上九: 鸿渐于陆，其羽可用为仪，吉。\r\n象曰：其羽可用为仪，吉；不可乱也。";
                        break;
                    case "8":
                        drawKun(p, g, false);
                        label7.Text = "风地观258";
                        txtContent.Text = "风地观:盥而不荐，有孚颙若。\r\n 彖曰：大观在上，顺而巽，中正以观天下。观，盥而不荐，有孚颙若，下观而化也。 观天之神道，而四时不忒， 圣人以神道设教，而天下服矣。\r\n 象曰：风行地上，观；先王以省方，观民设教。\r\n初六: 童观，小人无咎，君字吝。\r\n 象曰：初六童观，小人道也。\r\n六二: 窥观，利女贞。\r\n 象曰：窥观女贞，亦可丑也。\r\n六三: 观我生，进退。\r\n 象曰：观我生，进退；未失道也。\r\n六四: 观国之光，利用宾于王。\r\n 象曰：观国之光，尚宾也。\r\n九五: 观我生，君子。无咎。\r\n 象曰：观我生，观民也。\r\n上九: 观其生，君子。无咎。\r\n 象曰：观其生，志未平也。";
                        break;
                    default:
                        break;
                }

            }
            else if (label5.Text == "6")
            {
                drawKan(p, g, true);
                switch (label4.Text)
                {
                    case "1":
                        drawQian(p, g, false);
                        label7.Text = "水天需205";
                        txtContent.Text = "水天需:有孚，光亨，贞：吉，利涉大川。\r\n 彖曰：需，须也；险在前也。 刚健而不陷，其义不困穷矣。 需有孚，光亨，贞吉。 位乎天位，以正中也。 利涉大川，往有功也。\r\n 象曰：云上於天，需；君子以饮食宴乐。\r\n 初九: 需于郊，利用恒。无咎。\r\n 象曰：需于郊，不犯难行也。 利用恒，无咎；未失常也。\r\n 九二: 需于沙，小有言，终吉。\r\n 象曰：需于沙，衍在中也。 虽小有言，以终吉也。\r\n 九三: 需于泥，致寇至。\r\n 象曰：需于泥，灾在外也。 自我致寇，敬慎不败也。\r\n 六四: 需于血，出自穴。\r\n 象曰：需于血，顺以听也。\r\n 九五: 需于酒食。贞：吉。\r\n 象曰：酒食贞吉，以中正也。\r\n 上六: 入于穴，有不速之客三人来，敬之，终吉。\r\n 象曰：不速之客来，敬之终吉。 虽不当位，未大失也。";
                        break;
                    case "2":
                        drawDui(p, g, false);
                        label7.Text = "水泽节397";
                        txtContent.Text = "水泽节:亨。苦节，不可贞。\r\n彖曰：节，亨，刚柔分，而刚得中。苦节不可贞，其道穷也。说以行险，当位以节，中正以通。 天地节而四时成，节以制度，不伤财，不害民。\r\n象曰：泽上有水，节；君子以制数度，议德行。\r\n初九: 不出户庭。无咎。\r\n象曰：不出户庭，知通塞也。\r\n九二: 不出门庭。凶。\r\n象曰：不出门庭，失时极也。\r\n六三: 不节若，则嗟若。无咎。\r\n象曰：不节之嗟，又谁咎也。\r\n六四: 安节，亨。\r\n象曰：安节之亨，承上道也。\r\n九五: 甘节，吉。往有尚。\r\n象曰：甘节之吉，居位中也。\r\n上六: 苦节。贞：凶，悔亡。\r\n象曰：苦节贞凶，其道穷也。";
                        break;
                    case "3":
                        drawLi(p, g, false);
                        label7.Text = "水火既济408";
                        txtContent.Text = "水火既济:亨，小利贞，初吉终乱。\r\n彖曰：既济，亨，小者亨也。利贞，刚柔正而位当也。 初吉，柔得中也。终止则乱，其道穷也。\r\n象曰：水在火上，既济；君子以思患而预防之。\r\n初九: 曳其轮，濡其尾。无咎。\r\n象曰：曳其轮， 义无咎也。\r\n六二: 妇丧其苇，勿逐，七日得。\r\n象曰：七日得，以中道也。\r\n九三: 高宗伐鬼方，三年克之。小人勿用。\r\n象曰：三年克之，惫也。\r\n六四: 儒有衣袼，终日戒。\r\n象曰：终日戒，有所疑也。\r\n九五: 东邻杀牛，不如西邻之瀹祭，实受其福。\r\n象曰：东邻杀牛，不如西邻之时也；实受其福，吉大来也。\r\n上六: 濡其首，厉。\r\n象曰：濡其首厉，何可久也。";
                        break;
                    case "4":
                        drawZhen(p, g, false);
                        label7.Text = "水雷屯198";
                        txtContent.Text = "水雷屯:元亨，利贞。勿用有攸往，利建侯。\r\n彖曰：屯，刚柔始交而难生，动乎险中，大亨贞。雷雨之动满盈，天造草昧，宜建侯而不宁。\r\n象曰：云，雷，屯；君子以经纶。\r\n初九: 磐桓，利居。贞：利建侯。\r\n象曰：虽磐桓，志行正也。 以贵下贱，大得民也。\r\n六二: 屯如遵如，乘马班如，匪寇婚媾，女子贞不字，十年乃字。\r\n象曰：六二之难，乘刚也。 十年乃字，反常也。\r\n六三: 即鹿无虞，惟入于林中，君子几不如舍，往吝。\r\n象曰：既鹿无虞，以纵禽也。 君子舍之，往吝穷也。\r\n六四: 乘马班如，求婚媾。往，吉，无不利。\r\n象曰：求而往，明也。\r\n九五: 屯其膏。小贞：吉；大贞：凶。\r\n象曰：屯其膏，施未光也。\r\n上六: 乘马班如，泣血涟如。\r\n象曰：泣血涟如，何可长也。";
                        break;
                    case "5":
                        drawXun(p, g, false);
                        label7.Text = "水风井355";
                        txtContent.Text = "水风井:改邑不改井，无丧无得。往来井，井汔，至亦未墒井，羸其瓶。凶。  彖曰：巽乎水而上水，井；井养而不穷也。改邑不改井，乃以刚中也。汔至亦未繘井，未有功也。 羸其瓶，是以凶也。\r\n象曰：木上有水，井；君子以劳民劝相。\r\n初六: 井泥不食，旧井无禽。\r\n象曰：井泥不食，下也。 旧井无禽，时舍也。\r\n九二: 井谷射鲋，瓮敝漏。\r\n象曰：井谷射鲋，无与也。\r\n九三: 井渫不食，为我心恻，可用汲？王明，并受其福。\r\n象曰：井渫不食，行恻也。 求王明，受福也。\r\n六四: 井甃。无咎。\r\n象曰：井甃无咎，修井也。\r\n九五: 井冽寒泉食。\r\n象曰：寒泉之食，中正也。\r\n上六: 井收勿幕，有孚。元吉。\r\n象曰：元吉在上，大成也。";
                        break;
                    case "6":
                        drawKan(p, g, false);
                        label7.Text = "坎为水291";
                        txtContent.Text = "坎为水:有孚维心，亨，行有尚。\r\n彖曰：习坎，重险也。 水流而不盈，行险而不失其信。 维心亨，乃以刚中也。 行有尚，往有功也。 天险不可升也，地险山川丘陵也，王公设险以守其国，坎之时用大矣哉！\r\n象曰：水洊至，习坎；君子以常德行，习教事。\r\n初六: 习坎，入于坎窑。凶。\r\n象曰：习坎入坎，失道凶也。\r\n九二: 坎有险，求小得。\r\n象曰：求小得，未出中也。\r\n六三: 来之坎，坎险且枕，入于坎窑。勿用。\r\n象曰：来之坎坎，终无功也。\r\n六四: 樽酒簋贰，用缶纳约自牖。终无咎。\r\n象曰：樽酒簋贰，刚柔际也。\r\n九五: 坎不盈，祗既平。无咎。\r\n象曰：坎不盈，中未大也。\r\n上六: 系用徽嘿，置于丛棘，三岁不得。凶。\r\n象曰：上六失道，凶三岁也。";
                        break;
                    case "7":
                        drawGen(p, g, false);
                        label7.Text = "水山蹇325";
                        txtContent.Text = "水山蹇:利西南，不利东北，利见大人。贞：吉。\r\n彖曰：蹇，难也，险在前也。 见险而能止，知矣哉！蹇利西南， 往得中也；不利东北，其道穷也。 利见大人，往有功也。 当位贞吉，以正邦也。 蹇之时用大矣哉！\r\n象曰：山上有水，蹇；君子以反身修德。\r\n初六: 往蹇来誉。\r\n象曰：往蹇来誉，宜待也。\r\n六二: 王臣蹇蹇，匪躬之故。\r\n象曰：王臣蹇蹇，终无尤也。\r\n九三: 往蹇来反。\r\n象曰：往蹇来反，内喜之也。\r\n六四: 往蹇来连。\r\n象曰：往蹇来连，当位实也。\r\n九五: 大蹇朋来。\r\n象曰：大蹇朋来，以中节也。\r\n上六: 往蹇来硕。吉，利见大人。\r\n象曰：往蹇来硕，志在内也。 利见大人，以从贵也。";
                        break;
                    case "8":
                        drawKun(p, g, false);
                        label7.Text = "水地比217";
                        txtContent.Text = "水地比:吉。原筮，元永贞，无咎。不宁方来后，夫凶。\r\n彖曰：比，吉也，比，辅也，下顺从也。 原筮元永贞，无咎，以刚中也。不宁方来，上下应也。 后夫凶，其道穷也。\r\n象曰：地上有水，比；先王以建万国，亲诸侯。\r\n初六: 有孚，比之，无咎。有孚盈缶，终来有它，吉。\r\n象曰：比之初六，有他吉也。\r\n六二: 比之自内。贞：吉。\r\n象曰：比之自内，不自失也。\r\n六三: 比之匪人。\r\n象曰：比之匪人，不亦伤乎！\r\n六四: 外比之。贞：吉。\r\n象曰：外比於贤，以从上也。\r\n九五: 显比，王用三驱，失前禽，邑人不诫，吉。\r\n象曰：显比之吉，位正中也。舍逆取顺，失前禽也。 邑人不诫，上使中也。\r\n上六: 比之无首，凶。\r\n象曰：比之无首，无所终也。";
                        break;
                    default:
                        break;
                }

            }
            else if (label5.Text == "7")
            {
                drawGen(p, g, true);
                switch (label4.Text)
                {
                    case "1":
                        drawQian(p, g, false);
                        label7.Text = "山天大畜279";
                        txtContent.Text = "山天大畜:利贞。不家食，吉、利涉大川。\r\n彖曰：大畜，刚健笃实辉光，日新其德，刚上而尚贤。 能止健，大正也。不家食吉，养贤也。 利涉大川，应乎天也。\r\n象曰：天在山中，大畜；君子以多识前言往行，以畜其德。\r\n初九: 有厉，利己。\r\n象曰：有厉利已，不犯灾也。\r\n九二: 舆说辐。\r\n象曰：舆说辐，中无尤也。\r\n九三: 良马逐。利艰贞。曰：闲舆卫，利有攸往。\r\n象曰：利有攸往，上合志也。\r\n六四: 童牛之牿。元吉。\r\n象曰：六四元吉，有喜也。\r\n六五: 坟豕之牙，吉。\r\n象曰：六五之吉，有庆也。\r\n上九: 何天之衢，亨。\r\n象曰：何天之衢，道大行也。";
                        break;

                    case "2":
                        drawDui(p, g, false);
                        label7.Text = "山泽损334";
                        txtContent.Text = "山泽损:有孚。元吉，无咎。可贞，利有攸往。曷之用二簋，可用亨。\r\n彖曰：损，损下益上，其道上行。损而有孚，元吉，无咎，可贞，利有攸往。 曷之用？ 二簋可用享；二簋应有时。损刚益柔有时，损益盈虚，与时偕行。\r\n象曰：山下有泽，损；君子以惩忿窒欲。\r\n初九: 已事遄往，无咎。酌损之。\r\n象曰：已事遄往，尚合志也。\r\n九二: 利贞，征凶，弗损益之。\r\n象曰：九二利贞，中以为志也。\r\n六三: 三人行则损一人，一人行则得其友。\r\n象曰：一人行，三则疑也。\r\n六四: 损其疾，使遄有喜。无咎。\r\n象曰：损其疾，亦可喜也。\r\n六五: 或益之十朋之龟，弗克违。元吉。\r\n象曰：六五元吉，自上佑也。\r\n上九: 弗损益之，无咎。贞：吉。利有攸往，得臣无家。\r\n象曰：弗损益之，大得志也。";
                        break;
                    case "3":
                        drawLi(p,g,false);
                        label7.Text = "山火贲264";
                        txtContent.Text = "山火贲:亨。小利有攸往。\r\n彖曰：贲，亨；柔来而文刚，故亨。分刚上而文柔，故小利有攸往。天文也；文明以止，人文也。观乎天文，以察时变；观乎人文，以化成天下。\r\n象曰：山下有火，贲；君子以明庶政，无敢折狱。\r\n初九: 贲其趾，舍车而徒。\r\n象曰：舍车而徒，义弗乘也。\r\n六二: 贲其须。\r\n象曰：贲其须，与上兴也。\r\n九三: 贲如濡如。永贞吉。\r\n象曰：永贞之吉，终莫之陵也。\r\n六四: 贲如皤如，白马翰如，匪寇婚媾。\r\n象曰：六四，当位疑也。 匪寇婚媾，终无尤也。\r\n六五: 贲于丘园，束帛戋戋，吝，终吉。\r\n象曰：六五之吉，有喜也。\r\n上九: 白贲，无咎。\r\n象曰：白贲无咎，上得志也";
                        break;
                    case "4":
                        drawZhen(p, g, false);
                        label7.Text = "山雷颐282";
                        txtContent.Text = "山雷颐:贞：吉。观颐，自求口实。\r\n彖曰：颐贞吉，养正则吉也。 观颐，观其所养也； 自求口实，观其自养也。 天地养万物，圣人养贤，以及万民；颐之时义大矣哉！\r\n象曰：山下有雷，颐；君子以慎言语，节饮食。\r\n初九: 舍尔灵龟，观我朵颐。凶。\r\n象曰：观我朵颐，亦不足贵也。\r\n六二: 颠颐，拂经于丘。颐，征凶。\r\n象曰：六二征凶，行失类也。\r\n六三: 拂颐。贞：凶，十年勿用，无攸利。\r\n象曰：十年勿用，道大悖也。\r\n六四: 颠颐，吉。虎视耽耽，其欲逐逐。无咎。\r\n象曰：颠颐之吉，上施光也。\r\n六五: 拂经，居，贞：吉、不可涉大川。\r\n象曰：居贞之吉，顺以从上也。\r\n上九: 由颐。厉，吉、利涉大川。\r\n象曰：由颐厉吉，大有庆也。";
                        break;
                    case "5":
                        drawXun(p, g, false);
                        label7.Text = "山风蛊252";
                        txtContent.Text = "山风蛊:元亨，利涉大川。先甲三日，后甲三日。\r\n彖曰：蛊，刚上而柔下，巽而止，蛊。 蛊，元亨，而天下治也。 利涉大川，往有事也。 先甲三日，后甲三日，终则有始，天行也。\r\n象曰：山下有风，蛊；君子以振民育德。\r\n初六:干父之蛊，有子考，无咎，厉，终吉。\r\n象曰：干父之蛊，意承考也。\r\n九二:干母之蛊，不可贞。\r\n象曰：干母之蛊，得中道也。\r\n九三:干父之蛊，小有悔，无大咎。\r\n象曰：干父之蛊，终无咎也。\r\n六四:裕父之蛊，往见吝。\r\n象曰：裕父之蛊，往未得也。\r\n六五:干父之蛊，用誉。\r\n象曰：干父之蛊；承以德也。\r\n上九:不事王侯，高尚其事。\r\n象曰：不事王侯，志可则也";
                        break;
                    case "6":
                        drawKan(p, g, false);
                        label7.Text = "山水蒙201";
                        txtContent.Text = "山水蒙:亨。匪我求童蒙，童蒙求我。初筮告，再三渎，渎则不告。利贞。\r\n彖曰：蒙，山下有险，险而止，蒙。 蒙亨，以亨行时中也。匪我求童蒙，童蒙求我，志应也。 初噬告，以刚中也。再三渎， 渎则不告，渎蒙也。 蒙以养正，圣功也。\r\n象曰：山下出泉，蒙；君子以果行育德。\r\n初六:发蒙，利用刑人，用说桎梏，以往吝。\r\n象曰：利用刑人，以正法也。\r\n九二:包蒙，吉；纳妇，吉；子克家。\r\n象曰：子克家，刚柔接也。\r\n六三:勿用取女，见金夫，不有躬，无攸利。\r\n象曰：勿用娶女，行不顺也。\r\n六四:困蒙。吝。\r\n象曰：困蒙之吝，独远实也。\r\n六五:童蒙，吉。\r\n象曰：童蒙之吉，顺以巽也。\r\n上九:击蒙，不利为寇，利御寇。\r\n象曰：利用御寇，上下顺也。";
                        break;
                    case "7":
                        drawGen(p, g, false);
                        label7.Text = "艮为山368";
                        txtContent.Text = "艮为山:其背，不或其身。行其庭，不见其人。无咎。\r\n彖曰：艮，止也。 时止则止，时行则行，动静不失其时，其道光明。 艮其止，止其所也。 上下敌应，不相与也。 是以不获其身，行其庭不见其人，无咎也。\r\n象曰：兼山，艮；君子以思不出其位。\r\n初六:艮其趾。无咎、利永贞。\r\n象曰：艮其趾，未失正也。\r\n六二:艮其腓，不拯其随，其心不快。\r\n象曰：不拯其随，未退听也。\r\n九三:艮其限，列其夤，厉薰心。\r\n象曰：艮其限，危薰心也。\r\n六四:艮其身。无咎。\r\n象曰：艮其身，止诸躬也。\r\n六五:艮其辅，言有序。悔亡。\r\n象曰：艮其辅，以中正也。\r\n上九:敦艮，吉。\r\n象曰：敦艮之吉，以厚终也。";
                        break;
                    case "8":
                        drawKun(p, g, false);
                        label7.Text = "山地剥268";
                        txtContent.Text = "山地剥:不利有攸往。\r\n彖曰：剥，剥也，柔变刚也。 不利有攸往，小人长也。 顺而止之，观象也。 君子尚消息盈虚，天行也。\r\n象曰：山附地上，剥；上以厚下，安宅。\r\n初六:剥床以足蔑。贞：凶。\r\n象曰：剥牀以足，以灭下也。\r\n六二:剥床以辨蔑。贞：凶。\r\n象曰：剥牀以辨，未有与也。\r\n六三:剥之，无咎。\r\n象曰：剥之无咎，失上下也。\r\n六四:剥床以肤。凶。\r\n象曰：剥牀以肤，切近灾也。\r\n六五:贯鱼，以宫人宠，无不利。\r\n象曰：以宫人宠，终无尤也。\r\n上九:硕果不食，君子得舆，小人剥庐。\r\n象曰：君子得舆，民所载也。 小人剥庐，终不可用也。";
                        break;
                    default:
                        break;
                }

            }
            else if (label5.Text == "8")
            {
                drawKun(p, g, true);
                switch (label4.Text)
                {
                    case "1":
                        drawQian(p, g, false);
                        label7.Text = "地天泰228"; txtContent.Text = "地天泰:小往大来，吉，亨。\r\n彖曰：泰，小往大来，吉亨。则是天地交，而万物通也；上下交，而其志同也。内阳而外阴，内健而外顺，内君子而外小人，君子道长，小人道消也。\r\n象曰：天地交泰，后以财（裁）成天地之道，辅相天地之宜，以左右民。\r\n初九: 拔茅茹以其汇。征，吉。\r\n象曰：拔茅征吉，志在外也。\r\n九二: 包荒，用冯河，不遐遗，朋亡得尚于中行。\r\n象曰：包荒，得尚于中行，以光大也。\r\n九三: 无平不陂，无往不复。艰贞：无咎，勿恤其孚，于食有福。\r\n象曰：无往不复，天地际也。\r\n六四: 翩翩，不富以其邻不戒，以孚。\r\n象曰：翩翩不富，皆失实也。 不戒以孚，中心愿也。\r\n六五: 帝乙归妹以祉。元吉。\r\n象曰：以祉元吉，中以行愿也。\r\n上六: 城复于隍，勿用师，自邑告命。贞：吝。\r\n象曰：城复于隍，其命乱也。";
                        break;
                    case "2":
                        drawDui(p, g, false);
                        label7.Text = "地泽临255"; txtContent.Text = "地泽临:元亨利贞，至于八月有凶。\r\n彖曰：临，刚浸而长。 说而顺，刚中而应，大亨以正，天之道也。 至于八月有凶，消不久也。\r\n象曰：泽上有地，临； 君子以教思无穷，容保民无疆。\r\n初九: 咸临。贞：吉。\r\n象曰：咸临贞吉，志行正也。\r\n九二: 咸临。吉，无不利。\r\n象曰：咸临，吉无不利；未顺命也。\r\n六三: 甘临，无攸利；既忧之，无咎。\r\n象曰：甘临，位不当也。 既忧之，咎不长也。\r\n六四: 至临，无咎。\r\n象曰：至临无咎，位当也。\r\n六五: 知临，大君之宜。吉。\r\n象曰：大君之宜，行中之谓也。\r\n上六: 敦临。吉，无咎。\r\n象曰：敦临之吉，志在内";
                        break;
                    case "3":
                        drawLi(p, g, false);
                        label7.Text = "地火明夷315"; txtContent.Text = "地火明夷:利，艰贞。\r\n彖曰：明入地中，明夷。 内文明而外柔顺，以蒙大难，文王以之。 利艰贞，晦其明也，内难而能正其志，箕子以之。\r\n象曰：明入地中，明夷；君子以莅众，用晦而明。\r\n初九:明夷于飞，垂其翼。君子于行，三日不食，有攸往，主人有言。\r\n象曰：君子于行，义不食也。\r\n六二:明夷，夷于左股，用拯马壮。吉。\r\n象曰：六二之吉，顺以则也。\r\n九三:明夷，于南狩，得其大首，不可疾贞。\r\n象曰：南狩之志，乃大得也。\r\n六四:入于左腹，获明夷，之心于出门庭。\r\n象曰：入于左腹，获心意也。\r\n六五:箕子之明夷，利贞。\r\n象曰：箕子之贞，明不可息也。\r\n上六:不明，晦。初登于天，后入于地。\r\n象曰：初登于天，照四国也。 后入于地，失则也。";
                        break;
                    case "4":
                        drawZhen(p, g, false);
                        label7.Text = "地雷复271"; txtContent.Text = "地雷复:亨。出入无疾，朋来。无咎。反复其道，七日来复。利有攸往。\r\n彖曰：复亨；刚反，动而以顺行，是以出入无疾，朋来无咎。 反复其道，七日来复，天行也。 利有攸往，刚长也。 复其见天地之心乎？\r\n象曰：雷在地中，复；先王以至日闭关，商旅不行，后不省方。\r\n初九:不远复，无祗悔。元吉。\r\n象曰：不远之复，以修身也。\r\n六二:休复，吉。\r\n象曰：休复之吉，以下仁也。\r\n六三:频复。厉、无咎。\r\n象曰：频复之厉，义无咎也。\r\n六四:中行独复。\r\n象曰：中行独复，以从道也。\r\n六五:敦复，无悔。\r\n象曰：敦复无悔，中以自考也。\r\n上六:迷复，凶，有灾眚。用行师，终有大败。以其国君凶至，于十年不克征。\r\n象曰：迷复之凶，反君道也";
                        break;
                    case "5":
                        drawXun(p, g, false);
                        label7.Text = "地风升349"; txtContent.Text = "地风升:元亨，用见大人。勿恤，南征，吉。\r\n彖曰：柔以时升，巽而顺，刚中而应，是以大亨。用见大人，勿恤；有庆也。 南征吉，志行也。\r\n象曰：地中生木，升；君子以顺德，积小以高大。\r\n初六:允升，大吉。\r\n象曰：允升大吉，上合志也。\r\n九二:孚乃利用瀹。无咎。\r\n象曰：九二之孚，有喜也。\r\n九三:升虚邑。\r\n象曰：升虚邑，无所疑也。\r\n六四:王用亨于岐山。吉、无咎。\r\n象曰：王用亨于岐山，顺事也。\r\n六五:贞：吉。升阶。\r\n象曰：贞吉升阶，大得志也。\r\n上六:冥升，利于不息之贞。\r\n象曰：冥升在上，消不富也。";
                        break;
                    case "6":
                        drawKan(p, g, false);
                        label7.Text = "地水师213"; txtContent.Text = "地水师:贞，丈人吉，无咎。\r\n彖曰：师，众也，贞正也，能以众正，可以王矣。 刚中而应，行险而顺，以此毒天下，而民从之，吉又何咎矣。\r\n象曰：地中有水，师；君子以容民畜众。\r\n初六:师出以律，否臧凶。\r\n象曰：师出以律，失律凶也。\r\n九二:在师中，吉，无咎。王三锡命。\r\n象曰：在师中吉，承天宠也。 王三锡命，怀万邦也。\r\n六三:师或舆尸，凶。\r\n象曰：师或舆尸，大无功也。\r\n六四:师左次。无咎。\r\n象曰：左次无咎，未失常也。\r\n六五:田有禽，利执言。无咎。长子帅师，弟子舆尸。贞：凶。\r\n象曰：长子帅师，以中行也。弟子舆师，使不当也。\r\n上六:大君有命，开国承家，小人勿用。\r\n象曰：大君有命，以正功也。 小人勿用，必乱邦也";
                        break;
                    case "7":
                        drawGen(p, g, false);
                        label7.Text = "地山谦242"; txtContent.Text = "天山遁:亨小，利贞。\r\n彖曰：遯亨，遯而亨也。 刚当位而应，与时行也。 小利贞，浸而长也。遯之时义大矣哉！\r\n象曰：天下有山，遯；君子以远小人，不恶而严。\r\n初六:遁尾厉，勿用有攸往。\r\n象曰：遯尾之厉，不往何灾也。\r\n六二:执之用黄牛之革，莫之胜说。\r\n象曰：执用黄牛，固志也。\r\n九三:系遁，有疾厉畜臣妾，吉。\r\n象曰：系遯之厉，有疾惫也。 畜臣妾吉，不可大事也。\r\n九四:好遁。君子吉，小人否。\r\n象曰：君子好遯，小人否也。\r\n九五:嘉遁。贞：吉。\r\n象曰：嘉遯贞吉，以正志也。\r\n上九:肥遁。无不利。\r\n象曰：肥遯，无不利；无所疑也。";
                        break;
                    case "8":
                        drawKun(p, g, false);
                        label7.Text = "坤为地195"; txtContent.Text = "坤为地:元亨，利牝马之贞。君子有攸往，先迷后得。主利，西南得朋，东北丧朋。安，贞：吉。\r\n彖曰：至哉坤元，万物资生，乃顺承天。 坤厚载物，德合无疆。 含弘光大，品物咸亨。 牝马地类，行地无疆，柔顺利贞。 君子攸行，先迷失道，后顺得常。 西南得朋，乃与类行；东北丧朋，乃终有庆。安贞之吉，应地无疆。\r\n象曰：地势坤，君子以厚德载物。\r\n初六:履霜，坚冰至。\r\n象曰：履霜坚冰，阴始凝也。 驯致其道，至坚冰也。\r\n六二:直方大，不习，无不利。\r\n象曰：六二之动，直以方也。 不习无不利，地道光也。\r\n六三:含章可贞，或从王事，无成有终。\r\n象曰：含章可贞；以时发也。 或从王事，知光大也。\r\n六四:括囊，无咎无誉。\r\n象曰：括囊无咎，慎不害也。\r\n六五:黄裳，元吉。\r\n象曰：黄裳元吉，文在中也。\r\n上六:龙战于野，其血玄黄。\r\n象曰：战龙於野，其道穷也。";
                        break;
                    default:
                        break;
                }

            }
            drawDongYao(p, g, label6.Text);
        }


        /// <summary>
        /// 手工指定卦
        /// </summary>
        /// <param name="sender"></param>
        /// <param name="e"></param>
        private void btnCalc_Click(object sender, EventArgs e)
        {
            Random rd = new Random();
            int i = rd.Next(100, 1000);

            textBox1.Text = i.ToString();
            if (i % 8 == 0)
                label4.Text = 8.ToString();
            else
                label4.Text = (i % 8).ToString();


            i = rd.Next(100, 1000);

            textBox2.Text = i.ToString();
            if (i % 8 == 0)
                label5.Text = 8.ToString();
            else
                label5.Text = (i % 8).ToString();


            i = rd.Next(100, 1000);
            textBox3.Text = i.ToString();
            if (i % 6 == 0)
                label6.Text = 6.ToString();
            else
                label6.Text = (i % 6).ToString();

            DrawGua();
            btnSave.Focus();


        }

        private void btnClear_Click(object sender, EventArgs e)
        {
            label4.Text = label5.Text = label6.Text = null;
            label7.Text = null;
            textBox1.Text = textBox2.Text = textBox3.Text = null;
            textBox4.Text = calcTodayOrYestoday() + "最高价是多少  从开盘到收盘整体趋势上涨还是下跌";
            label8.Text = DateTime.Now.ToString();
            textBox1.Focus();
        }

        private void Form1_Load(object sender, EventArgs e)
        {
            label4.Text = label5.Text = label6.Text = "0";
            label7.Text = null;
        }

        private void textBox1_TextChanged(object sender, EventArgs e)
        {
            //if (textBox1.Text.Length == 3)
            //{
            //    textBox2.Focus();
            //}
        }

        private void textBox2_TextChanged(object sender, EventArgs e)
        {
            //if (textBox2.Text.Length == 3)
            //{
            //    textBox3.Focus();
            //}

        }
        //变爻输入框
        private void textBox3_TextChanged(object sender, EventArgs e)
        {
            //if (textBox3.Text.Length == 3)
            //{
            //    btnCalc.Focus();
            //}

        }
        //求测事件输入框
        private void textBox4_KeyDown(object sender, KeyEventArgs e)
        {
            if (e.KeyCode == Keys.Enter)//如果输入的是回车键  
            {
                textBox1.Focus();
            }
            else if (e.KeyCode == Keys.Tab)//如果输入的是回车键  
            {
                textBox1.Focus();
            }
        }
        //变爻按下回车键
        private void textBox3_KeyDown(object sender, KeyEventArgs e)
        {
            if (e.KeyCode == Keys.Enter)//如果输入的是回车键  
            {
                this.btnCalc_Click(sender, e);
            }
        }

        private void Form1_Shown(object sender, EventArgs e)
        {
            textBox1.TabIndex = 0;
            textBox1.Focus();
        }
        /*保存卦*/
        private void btnSave_Click(object sender, EventArgs e)
        {
            SaveFileDialog SavaData = new SaveFileDialog();
            SavaData.Title = "保存文件";
            SavaData.InitialDirectory = @"D:\断卦";
            SavaData.Filter = "TXT文件(*.txt)|*.txt";
            SavaData.FileName = DateTime.Now.ToLongDateString().ToString()  + textBox4.Text;
            /*用户可能还没有计算,错误操作点击了保存*/
            if (label6.Text == "0")
            {
                MessageBox.Show("还没有计算");
                return;
            }

            else if (label6.Text == null)
            {
                MessageBox.Show("还没有计算");
                return;
            }
            else
            {
                /*已经计算完毕开始保存*/
                DialogResult result = SavaData.ShowDialog();
                string path = SavaData.FileName;
                if (path == "")
                {
                    return;
                }
                if (result == DialogResult.OK)
                {
                    using (FileStream fsWrite = new FileStream(path, FileMode.OpenOrCreate, FileAccess.Write))
                    {
                        string content = "时间:" + label8.Text + "\r\n" + "问事:" + textBox4.Text + "\r\n" + "下卦:" + label4.Text + "\r\n" + "上卦:" + label5.Text + "\r\n" + "变爻" + label6.Text + "\r\n" + "名页:" + label7.Text;
                        byte[] buffer = Encoding.Default.GetBytes(content);
                        fsWrite.Write(buffer, 0, buffer.Length);
                    }
                    MessageBox.Show("保存成功");
                }
                else
                {
                    MessageBox.Show("保存取消");
                }

            }
            return;

        }

        private void label9_Click(object sender, EventArgs e)
        {

        }

        private void button1_Click(object sender, EventArgs e)
        {
            string path1 = @"D:\断卦";//必须有这个路径
            System.Diagnostics.Process.Start("explorer", path1);
        }

        private void textBox4_TextChanged(object sender, EventArgs e)
        {

        }

        private void textBox1_KeyDown(object sender, KeyEventArgs e)
        {
            if (e.KeyCode == Keys.Enter)//如果输入的是回车键  
            {
                textBox2.Focus();
            }
        }

        private void textBox2_KeyDown(object sender, KeyEventArgs e)
        {
            if (e.KeyCode == Keys.Enter)//如果输入的是回车键  
            {
                textBox3.Focus();
            }
        }

        private void button2_Click(object sender, EventArgs e)
        {
            if (textBox1.Text == "")
            {
                return;
            }
            if (textBox2.Text == "")
            {
                return;
            }
            if (textBox3.Text == "")
            {
                return;
            }

            int upRemain = Convert.ToInt32(textBox1.Text) % 8;

            if (upRemain == 0)
            {
                upRemain = 8;
            }

            label4.Text = upRemain.ToString();

            upRemain = Convert.ToInt32(textBox2.Text) % 8;

            if (upRemain == 0)
            {
                upRemain = 8;
            }

            label5.Text = upRemain.ToString();


            upRemain = Convert.ToInt32(textBox3.Text) % 6;

            if (upRemain == 0)
            {
                upRemain = 6;
            }

            label6.Text = upRemain.ToString();

            DrawGua();
            btnSave.Focus();
        }
    }
}
